// 프로그래밍이란?
// 프로그래밍이란 컴퓨터에게 실행을 요구하는 일종의 커뮤니케이션입니다. 이를 위해 먼저 무엇을 실행하고 싶은지 정의할 필요가 있습니다.
// 다시 말해, 프로그래밍에서 앞서 해결해야 할 문제(요구사항)를 명확히 이해한 후 적절한 문제 해결 방안을 정의할 필요가 있습니다.

// 이때 요구되는 것이 문제 해결 능력입니다.
// 문제 해결 능력을 알고리즘과 동일시할 필요는 없습니다.
// 문제 해결 능력 > 알고리즘

// 즉, 프로그래밍이란 0과 1밖에 알지 못하는 기계가 실행할 수 있을 정도로 정확하고 상세하게 요구사항을 설명하는 작업
// 이때 필요한 것이 컴퓨팅사고(Computational thinking)입니다.

// 이처럼 문제 해결능력을 바탕으로 정의된 문제 해결 방안은 컴퓨터에게 전달되어야 합니다.
// 이때 명령을 수행할 주체는 컴퓨터입니다.
// 따라서 사람이 이해할 수 있는 자연어가 아니라 컴퓨터가 이해할 수 있는 언어, 즉 기계어로 명령을 전달해야 합니다.

// 기계어로 직접 명령을 전달하는 것을 대신할 가장 유용한 대안은 사람이 이해할 수 있는 약속된 구문(문법)으로 구성된 프로그래밍 언어를 사용해
// 프로그램을 작성한 후, 그것을 컴퓨터가 이해할 수 있는 기계어로 변환하는 일종의 번역기를 이용하는 것입니다.
// 이 일종의 번역기를 컴파일러(Compiler) 혹은 인터프리터(Interpeter)라고 합니다.

// 사람 ===============> 컴파일러 혹은 인터프리터 ===============> 컴퓨터
//       프로그래밍 언어                             기계어
